Repository: januariocosta84/MpsWebsite
Catalog: locale/*/LC_MESSAGES/django.po
Languages: pt_pt

source: Suai Airport
pt_pt: Aeroporto de Suai

source: Read More
pt_pt: Ler Mais

source: Hera Power Station
pt_pt: central eléctrica Hera

source: Data Center
pt_pt: Centro de dados

source: Previous
pt_pt: Anterior

source: Next
pt_pt: Próxima

source: Information and Announcement
pt_pt: Informação e Anúncio

source: The IF manages 22 programs which are aligned to SDP and SDG goals and priorities.The Government funds the IF to execute the financing of projects from each program
pt_pt: O FI toma conta 22 programas do FI que estão alinhados com as prioridades e os objetivos do PED e SDG. O FI utiliza o orçamento alocado para pagar os projetos de cada programa

source: ROADS
pt_pt: ESTRADAS

source: Improvements of the Timor-Leste's road network is one of the priorities to diversify the economy
pt_pt: A melhoria da rede rodoviária ou estrada de Timor-Leste é uma das prioridades para diversificar a economia

source: AIRPORTS
pt_pt: AEROPORTOS

source: Connecting Timor-Leste to the world is crucial for the economic growth
pt_pt: A melhoria da rede rodoviária ou estrada de Timor-Leste é uma das prioridades para diversificar a economia

source: BRIDGES
pt_pt: PONTES

source: One of the programs with an intensive investment and as an integral part in improving the road network
pt_pt: Um dos programas com investimentos intensivos e como parte integrante da melhoria da rede rodoviária

source: Page is Under Construction
pt_pt: Página está em Construção

source: Page is Under Construction!
pt_pt: Página está em Construção!

source: Welcome to my site.
pt_pt: Bem vindo mai hau nia website

source: Major Project Secretariat
pt_pt: Secretariado dos Grandes Projetos

source: Secretariat Services Events
pt_pt: Eventos sobre os servicos do secretariado

source: Quick Links
pt_pt: Link Fácil

source: Goverment
pt_pt: Governo

source: Career
pt_pt: Carreira

source: References
pt_pt: Referência

source: FS Guideline
pt_pt: Guião do Estudo de Viabilidade

source: About
pt_pt: Sobre

source: Fund
pt_pt: Fundo

source: Team
pt_pt: Equipa

source: Payment Process
pt_pt: Processo Pagamento

source: Visibility Study
pt_pt: Estudo Viabilidade

source: Project Appraisal
pt_pt: Avaliação de Projetos

source: Quarter Report
pt_pt: Relatorio Trimestral
