Repository: januariocosta84/MpsWebsite
Catalog: mpswebsite/locale/*/LC_MESSAGES/django.po
Languages: tt

source: Suai Airport
tt: Aeroportu Suai

source: Read More
tt: Le Liu Tan

source: Hera Power Station
tt: Sentral Electrika Hera

source: Data Center
tt: Sentro Dados

source: Previous
tt: Ba kotuk

source: Next
tt: Ba Oin

source: All Events about Secretariat
tt: Eventos sira kona ba Secretariado

source: Information and Announcement
tt: Informasaun No Anunsiu sira

source: The IF manages 22 programs which are aligned to SDP and SDG goals and priorities.The Government funds the IF to execute the financing of projects from each program
tt: FI iha programa hamutuk 22 ne'ebé aliña tuir ho prioridade no objetivu husi PED no SDG sira nian. FI utiliza orsamentu alokadu ne'e hodi selu projetu sira husi kada programa

source: ROADS
tt: DALAN

source: Improvements of the Timor-Leste's road network is one of the priorities to diversify the economy
tt: Hadiak dalan sira iha Timor-Leste sai hanesan prioridade ida hodi bele diversifika ekonomia

source: AIRPORTS
tt: AEROPORTO

source: Connecting Timor-Leste to the world is crucial for the economic growth
tt: Liga Timor-Leste ba mundu ne'e krusiál ba kresimentu ekonomia

source: BRIDGES
tt: PONTES

source: One of the programs with an intensive investment and as an integral part in improving the road network
tt: Programa ida ne'e ho investimentu intensivu no hanesan parte integrante hodi hadiak dalan

source: Page is Under Construction
tt: Pájina Iha Hela Konstrusaun

source: Our Contact
tt: Ami nia kontaktu

source: Major Project Secretariat
tt: Secretariado Grandes projetos

source: Quick Links
tt: Link Lais

source: Goverment
tt: Governo

source: Career
tt: Kareira

source: Contact Us
tt: Kontaktu Ami

source: References
tt: Referensia

source: FS Guideline
tt: Guiaun FS

source: Home
tt: Uma

source: About
tt: Kona ba

source: Secreatariat
tt: Sekretariadu

source: Fund
tt: Fundu

source: Team
tt: Ekipa

source: Payment Process
tt: Prosesu pagamentus

source: Visibility Study
tt: Estudu Viabilidade

source: Project Appraisal
tt: Avaliasaun projetus

source: Program
tt: Programa

source: Quarter Report
tt: Relatoriu Trimestral

source: Contact
tt: Kontaktu
